month = int(input("Введите номер месяца: "))

if month > 12:
    print("Вы номер месяца вели не правильно")
elif month == 1:
    print("Месяц Январь. Количесво дней 31")
elif month == 2:
    print("Месяц Февраль. Количесво дней 28")
elif month == 3:
    print("Месяц Март. Количесво дней 31")
elif month == 4:
    print("Месяц Апрель. Количесво дней 30")
elif month == 5:
    print("Месяц Май. Количесво дней 31")
elif month == 6:
    print("Месяц Июнь. Количесво дней 30")
elif month == 7:
    print("Месяц Июль. Количесво дней 31")
elif month == 8:
    print("Месяц Август. Количесво дней 31")
elif month == 9:
    print("Месяц Сентябрь. Количесво дней 30")
elif month == 10:
    print("Месяц Октябрь. Количесво дней 31")
elif month == 11:
    print("Месяц Ноябрь. Количесво дней 30")
elif month == 12:
    print("Месяц Декабрь. Количесво дней 31")